export const OptionsCheckboxForDirection = [
    {value: "01.03.01", label: "01.03.01 Математика"},
    {value: "01.03.02", label: "01.03.02 Прикладная математика и информатика"},
    {value: "01.03.03", label: "01.03.03 Механика и математическое моделирование"},
    {value: "01.03.04", label: "01.03.04 Прикладная математика"},
    {value: "01.03.05", label: "01.03.05 Статистика"},
    {value: "01.04.01", label: "01.04.01 Математика"},
    {value: "01.04.02", label: "01.04.02 Прикладная математика и информатика"},
    {value: "01.04.03", label: "01.04.03 Механика и математическое моделирование"},
    {value: "01.04.04", label: "01.04.04 Прикладная математика"},
    {value: "01.04.05", label: "01.04.05 Статистика"},
    {value: "01.05.01", label: "01.05.01 Фундаментальные математика и механика"},
    {value: "01.06.01", label: "01.06.01 Математика и механика"},
    {value: "01.06.02", label: "01.06.02 Статистика"}
];
