const NodesBBK = [
    {
        key: '0',
        label: 'Естественные науки',
        children: [
            { key: '0-0', label: '20 Естественные науки в целом' },
            { key: '0-1', label: '20.1 Человек и окружающая среда. Экология человека. Экология в целом' },
            { key: '0-2', label: '20.18 Рациональное природопользование. Охрана природы' },
            { key: '0-3', label: 'Физико-математические науки', 
              children: [
                { key: '0-3-0', label: 'Физико-математические науки' },
                { key: '0-3-1', label: 'Физико-математические науки' },
                { key: '0-3-2', label: 'Физико-математические науки' },
                { key: '0-3-3', label: 'Физико-математические науки' },
              ] 
            },
            { key: '0-4', label: 'Химические науки', 
              children: [
                { key: '0-4-0', label: 'Химические науки' },
                { key: '0-4-1', label: 'Химические науки' },
                { key: '0-4-2', label: 'Химические науки' },
                { key: '0-4-3', label: 'Химические науки' },
              ] 
            },
            { key: '0-5', label: 'Биологические науки', 
              children: [
                { key: '0-5-0', label: 'Биологические науки' },
                { key: '0-5-1', label: 'Биологические науки' },
                { key: '0-5-2', label: 'Биологические науки' },
                { key: '0-5-3', label: 'Биологические науки' },
              ] 
            },
        ],
    },
    {
        key: '1',
        label: 'Техника. Технические науки',
        children: [
            { key: '1-0', label: 'Техника. Технические науки' },
            { key: '1-1', label: 'Техника. Технические науки' },
        ],
    },
    {
        key: '2',
        label: 'Сельское и лесное хозяйство',
        children: [
            { key: '2-0', label: 'Сельское и лесное хозяйство' },
            { key: '2-1', label: 'Сельское и лесное хозяйство' },
        ],
    },
    {
        key: '3',
        label: 'Здравоохранение. Медицинские науки',
        children: [
            { key: '3-0', label: 'Здравоохранение. Медицинские науки' },
            { key: '3-1', label: 'Здравоохранение. Медицинские науки' },
        ],
    },
    {
        key: '4',
        label: 'Общественные и гуманитраные науки',
        children: [
            { key: '4-0', label: 'Общественные и гуманитраные науки' },
            { key: '4-1', label: 'Общественные и гуманитраные науки' },
        ],
    },
];

export default NodesBBK;