const OptionsForEditions = [
    {
      label: "Нормативно-производственное издание",
      options: [
        { value: "Стандарт", label: "Стандарт" },
        { value: "Нормативные акты", label: "Нормативные акты" }
      ]
    },
    {
      label: "Научное издание",
      options: [
        { value: "Монография", label: "Монография" },
        { value: "Сборник научных трудов", label: "Сборник научных трудов" },
        { value: "Материалы конференции", label: "Материалы конференции" }
      ]
    },
    {
      label: "Производственно-практическое издание",
      options: [
        { value: "Инструктивно-методическое издание", label: "Инструктивно-методическое издание" },
        { value: "Практическое пособие", label: "Практическое пособие" },
        { value: "Практическое руководство", label: "Практическое руководство" }
      ]
    },
    {
      label: "Учебное издание",
      options: [
        { value: "Учебник", label: "Учебник" },
        { value: "Учебное пособие", label: "Учебное пособие" },
        { value: "Учебное наглядное пособие", label: "Учебное наглядное пособие" },
        { value: "Рабочая тетрадь", label: "Рабочая тетрадь" },
        { value: "Самоучитель", label: "Самоучитель" },
        { value: "Хрестоматия", label: "Хрестоматия" },
        { value: "Практикум", label: "Практикум" },
        { value: "Задачник", label: "Задачник" }
      ]
    },
    {
      label: "Справочное и словарно-энциклопедическое издание",
      options: [
        { value: "Энциклопедия", label: "Энциклопедия" },
        { value: "Словарь", label: "Словарь" },
        { value: "Энциклопедический словарь", label: "Энциклопедический словарь" },
        { value: "Языковой словарь", label: "Языковой словарь" },
        { value: "Орфографический словарь", label: "Орфографический словарь" },
        { value: "Разговорник", label: "Разговорник" },
        { value: "Толковый словарь", label: "Толковый словарь" },
        { value: "Терминологический словарь", label: "Терминологический словарь" },
        { value: "Путеводитель", label: "Путеводитель" },
        { value: "Справочник", label: "Справочник" },
        { value: "Библиографический справочник", label: "Библиографический справочник" },
        { value: "Библиографический словарь", label: "Библиографический словарь" }
      ]
    },
    {
      label: "Литературно-художественное издание",
      options: [
        { value: "Альманах", label: "Альманах" },
        { value: "Документально-художественное издание", label: "Документально-художественное издание" },
        { value: "Научно-художественное издание", label: "Научно-художественное издание" },
        { value: "Художественные произведения", label: "Художественные произведения" }
      ]
    },
    {
      label: "Популярные издания",
      options: [
        { value: "Издания для досуга", label: "Издания для досуга" }
      ]
    }
];

export default OptionsForEditions;

