const OptionsForTarget = [
    {
      label: "Образование",
      options: [
        { value: "Высшее образование", label: "Высшее образование" },
        { value: "Среднее профессиональное образование", label: "Среднее профессиональное образование" },
        { value: "Школа", label: "Школа" },
      ]
    },
    {
      label: "Уровни образования",
      options: [
        { value: "Специалитет", label: "Специалитет" },
        { value: "Бакалавриат", label: "Бакалавриат" },
        { value: "Магистратура", label: "Магистратура" },
        { value: "Аспирантура", label: "Аспирантура" },
      ]
    },
    {
      label: "Досуг",
      options: [
        { value: "Художественная и популярная литература", label: "Художественная и популярная литература" },
      ]
    },
    {
      label: "РКИ",
      options: [
        { value: "Русский как иностранный", label: "Русский как иностранный" },
      ]
    },
];

export default OptionsForTarget;

