import {TreeNode} from "./types";

export const mockNodesBbk = [
    {
        "key": "599",
        "label": "Естественные науки",
        "children": [
            {
                "key": "599-605",
                "label": "20 Естественные науки в целом",
                "children": [
                    {
                        "key": "605-24222",
                        "label": "20.1 Человек и окружающая среда. Экология человека. Экология в целом",
                        "children": []
                    },
                    {
                        "key": "605-24334",
                        "label": "20.18 Рациональное природопользование. Охрана природы",
                        "children": []
                    }
                ]
            },
            {
                "key": "599-606",
                "label": "22 Физико-математические науки",
                "children": [
                    {
                        "key": "606-3170",
                        "label": "22.1 Математика",
                        "children": []
                    },
                    {
                        "key": "606-674",
                        "label": "22.2 Механика",
                        "children": []
                    },
                    {
                        "key": "606-675",
                        "label": "22.3 Физика",
                        "children": []
                    },
                    {
                        "key": "606-9051",
                        "label": "22.6 Астрономия",
                        "children": []
                    }
                ]
            },
            {
                "key": "599-4572",
                "label": "24 Химические науки",
                "children": [
                    {
                        "key": "4572-24375",
                        "label": "24.1 Общая и неорганическая химия",
                        "children": []
                    },
                    {
                        "key": "4572-24226",
                        "label": "24.2 Органическая химия",
                        "children": []
                    },
                    {
                        "key": "4572-24529",
                        "label": "24.4 Аналитическая химия",
                        "children": []
                    },
                    {
                        "key": "4572-24223",
                        "label": "24.5 Физическая химия. Химическая физика",
                        "children": []
                    },
                    {
                        "key": "4572-24354",
                        "label": "24.6 Коллоидная химия (физико-химия дисперсных систем)",
                        "children": []
                    },
                    {
                        "key": "4572-24228",
                        "label": "24.7 Химия высокомолекулярных соединений (полимеров)",
                        "children": []
                    }
                ]
            },
            {
                "key": "599-608",
                "label": "26 Науки о Земле",
                "children": [
                    {
                        "key": "608-24822",
                        "label": "26.0 Земля в целом",
                        "children": []
                    },
                    {
                        "key": "608-24823",
                        "label": "26.1 Геодезические науки. Картография",
                        "children": []
                    },
                    {
                        "key": "608-24224",
                        "label": "26.2 Геофизические науки",
                        "children": []
                    },
                    {
                        "key": "608-24227",
                        "label": "26.3 Геологические науки",
                        "children": []
                    },
                    {
                        "key": "608-24824",
                        "label": "26.8 Географические науки",
                        "children": []
                    }
                ]
            },
            {
                "key": "599-4347",
                "label": "28 Биологические науки",
                "children": [
                    {
                        "key": "4347-24225",
                        "label": "28.0 Общая биология",
                        "children": []
                    },
                    {
                        "key": "4347-24827",
                        "label": "28.1 Палеонтология",
                        "children": []
                    },
                    {
                        "key": "4347-24828",
                        "label": "28.3 Вирусология",
                        "children": []
                    },
                    {
                        "key": "4347-24830",
                        "label": "28.4 Микробиология",
                        "children": []
                    },
                    {
                        "key": "4347-24831",
                        "label": "28.5 Ботаника",
                        "children": []
                    },
                    {
                        "key": "4347-24832",
                        "label": "28.6 Зоология",
                        "children": []
                    },
                    {
                        "key": "4347-24360",
                        "label": "28.7 Биология человека. Антропология",
                        "children": []
                    }
                ]
            }
        ]
    },
    {
        "key": "600",
        "label": "Техника. Технические науки",
        "children": [
            {
                "key": "600-609",
                "label": "30 Техника и технические науки в целом",
                "children": [
                    {
                        "key": "609-24352",
                        "label": "30.1 Общетехнические дисциплины",
                        "children": [
                            {
                                "key": "24352-20362",
                                "label": "30.10 Метрология. Техника измерения",
                                "children": []
                            },
                            {
                                "key": "24352-24353",
                                "label": "30.11 Черчение",
                                "children": []
                            },
                            {
                                "key": "24352-24221",
                                "label": "30.12 Техническая механика",
                                "children": []
                            },
                            {
                                "key": "24352-26152",
                                "label": "30.14 Теория надежности",
                                "children": []
                            },
                            {
                                "key": "24352-26153",
                                "label": "30.16 Техническая биология",
                                "children": []
                            },
                            {
                                "key": "24352-26154",
                                "label": "30.17 Эргономика",
                                "children": []
                            },
                            {
                                "key": "24352-26155",
                                "label": "30.18 Техническая эстетика. Промышленное искусство",
                                "children": []
                            }
                        ]
                    },
                    {
                        "key": "609-24372",
                        "label": "30.2 Проектирование",
                        "children": []
                    },
                    {
                        "key": "609-24358",
                        "label": "30.3 Сырье. Материалы техники. Материаловедение",
                        "children": []
                    },
                    {
                        "key": "609-28337",
                        "label": "30.4 Конструкции",
                        "children": []
                    },
                    {
                        "key": "609-24332",
                        "label": "30.6 Общая технология. Основы промышленного производства",
                        "children": [
                            {
                                "key": "24332-5956",
                                "label": "30.609 Продукция. Товароведение",
                                "children": []
                            }
                        ]
                    },
                    {
                        "key": "609-25494",
                        "label": "30.8 Монтаж, эксплуатация, ремонт машин и промышленного оборудования",
                        "children": []
                    }
                ]
            },
            {
                "key": "600-610",
                "label": "31 Энергетика",
                "children": [
                    {
                        "key": "610-24178",
                        "label": "31.2 Электроэнергетика. Электротехника",
                        "children": []
                    },
                    {
                        "key": "610-24177",
                        "label": "31.3 Теплоэнергетика. Теплотехника",
                        "children": []
                    },
                    {
                        "key": "610-24357",
                        "label": "31.4 Ядерная энергетика (атомная энергетика)",
                        "children": []
                    },
                    {
                        "key": "610-25095",
                        "label": "31.5 Гидроэнергетика",
                        "children": []
                    },
                    {
                        "key": "610-26157",
                        "label": "31.6 Другие отрасли энергетики",
                        "children": []
                    },
                    {
                        "key": "610-26158",
                        "label": "31.7 Техника сжатых и разряженных газов",
                        "children": []
                    },
                    {
                        "key": "610-24528",
                        "label": "31.15 Источники энергии, энергетические ресурсы",
                        "children": []
                    },
                    {
                        "key": "610-24373",
                        "label": "31.16 Энергетическое оборудование. Энергомашиностроение",
                        "children": []
                    },
                    {
                        "key": "610-26156",
                        "label": "31.19 Энергетическое хозяйство. Энергоснабжение",
                        "children": []
                    }
                ]
            },
            {
                "key": "600-611",
                "label": "32 Радиоэлектроника",
                "children": [
                    {
                        "key": "611-3969",
                        "label": "32.81 Кибернетика",
                        "children": []
                    },
                    {
                        "key": "611-4571",
                        "label": "32.84 Общая радиотехника",
                        "children": []
                    },
                    {
                        "key": "611-3682",
                        "label": "32.85 Электроника",
                        "children": []
                    },
                    {
                        "key": "611-6439",
                        "label": "32.86 Квантовая электроника",
                        "children": []
                    },
                    {
                        "key": "611-24374",
                        "label": "32.87 Электроакустика",
                        "children": []
                    },
                    {
                        "key": "611-5080",
                        "label": "32.88 Электрическая связь",
                        "children": []
                    },
                    {
                        "key": "611-677",
                        "label": "32.885 Электрическая сигнализация",
                        "children": []
                    },
                    {
                        "key": "611-7658",
                        "label": "32.94 Телевидение",
                        "children": []
                    },
                    {
                        "key": "611-24371",
                        "label": "32.95 Радиолокация",
                        "children": []
                    },
                    {
                        "key": "611-5058",
                        "label": "32.96 Автоматика и телемеханика",
                        "children": []
                    },
                    {
                        "key": "611-676",
                        "label": "32.97 Вычислительная техника",
                        "children": []
                    },
                    {
                        "key": "611-26734",
                        "label": "32.98 Оргтехника",
                        "children": []
                    },
                    {
                        "key": "611-45461",
                        "label": "32.99 Другие отрасли радиоэлектроники",
                        "children": []
                    }
                ]
            },
            {
                "key": "600-4226",
                "label": "33 Горное дело",
                "children": [
                    {
                        "key": "4226-26172",
                        "label": "33.1 Общие вопросы горного дела",
                        "children": []
                    },
                    {
                        "key": "4226-24527",
                        "label": "33.2 Отдельные способы разработки месторождений твердых полезных ископаемых",
                        "children": []
                    },
                    {
                        "key": "4226-26173",
                        "label": "33.3 Разработка месторождений отдельных видов полезных ископаемых",
                        "children": []
                    },
                    {
                        "key": "4226-26174",
                        "label": "33.4 Обогащение полезных ископаемых",
                        "children": []
                    }
                ]
            },
            {
                "key": "600-612",
                "label": "34 Технология металлов. Машиностроение. Приборостроение",
                "children": [
                    {
                        "key": "612-5113",
                        "label": "34.1 Общая технология металлов",
                        "children": []
                    },
                    {
                        "key": "612-5110",
                        "label": "34.2 Металловедение",
                        "children": []
                    },
                    {
                        "key": "612-5112",
                        "label": "34.3 Металлургия",
                        "children": []
                    },
                    {
                        "key": "612-5109",
                        "label": "34.4 Общее машиностроение. Машиноведение",
                        "children": []
                    },
                    {
                        "key": "612-5114",
                        "label": "34.5 Общая технология машиностроения. Обработка металлов",
                        "children": []
                    },
                    {
                        "key": "612-5108",
                        "label": "34.6 Отдельные машиностроительные и металлообрабатывающие процессы и производства",
                        "children": []
                    },
                    {
                        "key": "612-9050",
                        "label": "34.7 Технология производства оборудования отраслевого назначения",
                        "children": []
                    },
                    {
                        "key": "612-5117",
                        "label": "34.8 Производство металлических изделий (метизов)",
                        "children": []
                    },
                    {
                        "key": "612-5115",
                        "label": "34.9 Приборостроение",
                        "children": []
                    }
                ]
            },
            {
                "key": "600-4570",
                "label": "35 Химическая технология. Химические производства",
                "children": [
                    {
                        "key": "4570-50794",
                        "label": "35.09 Отходы химического производства и их использование",
                        "children": []
                    },
                    {
                        "key": "4570-37290",
                        "label": "35.102 Химия в быту",
                        "children": []
                    },
                    {
                        "key": "4570-26119",
                        "label": "35.11 Основные процессы и аппараты химической технологии",
                        "children": []
                    },
                    {
                        "key": "4570-28325",
                        "label": "35.20-46 Технология неорганических веществ. Технология основных химических продуктов",
                        "children": []
                    },
                    {
                        "key": "4570-27382",
                        "label": "35.50-78 Технология органических веществ",
                        "children": []
                    },
                    {
                        "key": "4570-29404",
                        "label": "35.79 Другие химические производства",
                        "children": []
                    }
                ]
            },
            {
                "key": "600-613",
                "label": "36 Пищевые производства",
                "children": [
                    {
                        "key": "613-24743",
                        "label": "36.81 Основные процессы и аппараты пищевых производств",
                        "children": []
                    },
                    {
                        "key": "613-26175",
                        "label": "36.82 Мукомольное и крупяное производства",
                        "children": []
                    },
                    {
                        "key": "613-26176",
                        "label": "36.83 Хлебопекарное производство (хлебопечение)",
                        "children": []
                    },
                    {
                        "key": "613-26177",
                        "label": "36.84 Сахарное производство",
                        "children": []
                    },
                    {
                        "key": "613-29398",
                        "label": "36.85 Крахмально-паточное производство",
                        "children": []
                    },
                    {
                        "key": "613-26179",
                        "label": "36.86 Кондитерское производство",
                        "children": []
                    },
                    {
                        "key": "613-26180",
                        "label": "36.87 Бродильное производство",
                        "children": []
                    },
                    {
                        "key": "613-26181",
                        "label": "36.88 Производство безалкогольных напитков",
                        "children": []
                    },
                    {
                        "key": "613-25741",
                        "label": "36.91 Переработка плодов и овощей",
                        "children": []
                    },
                    {
                        "key": "613-26183",
                        "label": "36.92 Производство мяса и мясных продуктов",
                        "children": []
                    },
                    {
                        "key": "613-26417",
                        "label": "36.93 Производство птицепродуктов",
                        "children": []
                    },
                    {
                        "key": "613-26185",
                        "label": "36.94 Производство рыбы и рыбных продуктов",
                        "children": []
                    },
                    {
                        "key": "613-26186",
                        "label": "36.95 Производство молока и молочных продуктов",
                        "children": []
                    },
                    {
                        "key": "613-26187",
                        "label": "36.96 Консервное производство",
                        "children": []
                    },
                    {
                        "key": "613-26188",
                        "label": "36.97 Производство пищевых концентратов",
                        "children": []
                    },
                    {
                        "key": "613-26189",
                        "label": "36.98 Производство вкусовых продуктов",
                        "children": []
                    },
                    {
                        "key": "613-26190",
                        "label": "36.99 Общественное питание. Кулинария",
                        "children": []
                    }
                ]
            },
            {
                "key": "600-4209",
                "label": "37 Технология древесины. Производства легкой промышленности",
                "children": [
                    {
                        "key": "4209-5573",
                        "label": "37.1 Технология древесины",
                        "children": []
                    },
                    {
                        "key": "4209-4210",
                        "label": "37.2 Производства легкой промышленности",
                        "children": []
                    },
                    {
                        "key": "4209-10054",
                        "label": "37.8 Полиграфическое производство",
                        "children": []
                    },
                    {
                        "key": "4209-11302",
                        "label": "37.9 Фотокинотехника",
                        "children": []
                    }
                ]
            },
            {
                "key": "600-4083",
                "label": "38 Строительство",
                "children": [
                    {
                        "key": "4083-13195",
                        "label": "38.1 Теоретические основы строительства",
                        "children": []
                    },
                    {
                        "key": "4083-7760",
                        "label": "38.2 Изыскания и проектирование в строительстве",
                        "children": []
                    },
                    {
                        "key": "4083-6616",
                        "label": "38.3 Строительные материалы и изделия",
                        "children": []
                    },
                    {
                        "key": "4083-19992",
                        "label": "38.4 Части зданий (архитектурные конструкции)",
                        "children": []
                    },
                    {
                        "key": "4083-6615",
                        "label": "38.5 Строительные конструкции",
                        "children": []
                    },
                    {
                        "key": "4083-4134",
                        "label": "38.6 Технология строительного производства",
                        "children": []
                    },
                    {
                        "key": "4083-4227",
                        "label": "38.7 Отдельные виды строительства",
                        "children": []
                    },
                    {
                        "key": "4083-4084",
                        "label": "38.9 Благоустройство населенных мест",
                        "children": []
                    }
                ]
            },
            {
                "key": "600-614",
                "label": "39 Транспорт",
                "children": [
                    {
                        "key": "614-4955",
                        "label": "39.1 Общие вопросы транспорта",
                        "children": []
                    },
                    {
                        "key": "614-4844",
                        "label": "39.2 Железнодорожный транспорт",
                        "children": []
                    },
                    {
                        "key": "614-4953",
                        "label": "39.3 Автодорожный транспорт",
                        "children": []
                    },
                    {
                        "key": "614-4829",
                        "label": "39.4 Водный транспорт",
                        "children": []
                    },
                    {
                        "key": "614-4842",
                        "label": "39.5 Воздушный транспорт",
                        "children": []
                    },
                    {
                        "key": "614-5574",
                        "label": "39.6 Межпланетные сообщения (межпланетные полеты)",
                        "children": []
                    },
                    {
                        "key": "614-16481",
                        "label": "39.7 Трубопроводный транспорт",
                        "children": []
                    },
                    {
                        "key": "614-26265",
                        "label": "39.8 Городской транспорт",
                        "children": []
                    },
                    {
                        "key": "614-4954",
                        "label": "39.9 Промышленный транспорт",
                        "children": []
                    }
                ]
            }
        ]
    },
    {
        "key": "601",
        "label": "Сельское и лесное хозяйство",
        "children": [
            {
                "key": "601-615",
                "label": "40 Естественнонаучные и технические основы сельского хозяйства",
                "children": [
                    {
                        "key": "615-10049",
                        "label": "40.0 Сельскохозяйственная биология (агробиология)",
                        "children": []
                    },
                    {
                        "key": "615-15725",
                        "label": "40.1 Агрофизика",
                        "children": []
                    },
                    {
                        "key": "615-13447",
                        "label": "40.2 Агрометеорология и агроклиматология",
                        "children": []
                    },
                    {
                        "key": "615-10055",
                        "label": "40.3 Почвоведение",
                        "children": []
                    },
                    {
                        "key": "615-12291",
                        "label": "40.4 Агрохимия",
                        "children": []
                    },
                    {
                        "key": "615-35874",
                        "label": "40.5 Сельскохозяйственная микробиология",
                        "children": []
                    },
                    {
                        "key": "615-10056",
                        "label": "40.6 Сельскохозяйственные мелиорации",
                        "children": []
                    },
                    {
                        "key": "615-678",
                        "label": "40.7 Механизация и электрификация сельского хозяйства",
                        "children": []
                    },
                    {
                        "key": "615-38630",
                        "label": "40.8 Сельскохозяйственные постройки",
                        "children": []
                    }
                ]
            },
            {
                "key": "601-10053",
                "label": "41 Общее растениеводство",
                "children": [
                    {
                        "key": "10053-62678",
                        "label": "41.2 Биологические основы растениеводства",
                        "children": []
                    },
                    {
                        "key": "10053-29402",
                        "label": "41.3 Селекция, семеноводство, сорта. Акклиматизация и интродукция",
                        "children": []
                    },
                    {
                        "key": "10053-31751",
                        "label": "41.4 Земледелие. Агротехника",
                        "children": []
                    },
                    {
                        "key": "10053-29405",
                        "label": "41.9 Особенности растениеводства в различных природных или искусственных условиях. География и природное районирование растениеводства",
                        "children": []
                    }
                ]
            },
            {
                "key": "601-10052",
                "label": "42 Специальное (частное) растениеводство",
                "children": [
                    {
                        "key": "10052-29403",
                        "label": "42.1 Полеводство",
                        "children": []
                    },
                    {
                        "key": "10052-27310",
                        "label": "42.2 Кормопроизводство. Кормовые растения",
                        "children": []
                    },
                    {
                        "key": "10052-29400",
                        "label": "42.3 Овощеводство и садоводство",
                        "children": []
                    }
                ]
            },
            {
                "key": "601-10050",
                "label": "43 Лесное хозяйство. Лесохозяйственные науки",
                "children": [
                    {
                        "key": "10050-10051",
                        "label": "43.4 Лесоводство",
                        "children": []
                    },
                    {
                        "key": "10050-13443",
                        "label": "43.9 Лесопользование (лесоэксплуатация)",
                        "children": []
                    }
                ]
            },
            {
                "key": "601-617",
                "label": "44 Защита растений",
                "children": [
                    {
                        "key": "617-29401",
                        "label": "44.6 Вредители растений и борьба с ними",
                        "children": []
                    },
                    {
                        "key": "617-29561",
                        "label": "44.7 Болезни растений и борьба с ними. Фитопатология",
                        "children": []
                    },
                    {
                        "key": "617-47278",
                        "label": "44.9 Защита сельскохозяйственных растений и леса от вредителей, болезней и вредных метеорологических факторов",
                        "children": []
                    }
                ]
            },
            {
                "key": "601-4451",
                "label": "45 Общее животноводство",
                "children": [
                    {
                        "key": "4451-27311",
                        "label": "45.2 Биологические основы животноводства",
                        "children": []
                    },
                    {
                        "key": "4451-35789",
                        "label": "45.3 Разведение и племенное дело",
                        "children": []
                    },
                    {
                        "key": "4451-29399",
                        "label": "45.4 Кормление и содержание животных",
                        "children": []
                    }
                ]
            },
            {
                "key": "601-13761",
                "label": "46 Специальное (частное) животноводство",
                "children": [
                    {
                        "key": "13761-27171",
                        "label": "46.0 Скотоводство. Крупный рогатый скот",
                        "children": []
                    },
                    {
                        "key": "13761-64702",
                        "label": "46.1 Коневодство. Ословодство и муловодство",
                        "children": []
                    },
                    {
                        "key": "13761-66996",
                        "label": "46.2 Верблюдоводство",
                        "children": []
                    },
                    {
                        "key": "13761-27172",
                        "label": "46.5 Свиноводство",
                        "children": []
                    },
                    {
                        "key": "13761-44593",
                        "label": "46.6 Овцеводство. Козоводство",
                        "children": []
                    },
                    {
                        "key": "13761-27169",
                        "label": "46.7 Мелкое животноводство",
                        "children": []
                    },
                    {
                        "key": "13761-27168",
                        "label": "46.8 Птицеводство",
                        "children": []
                    },
                    {
                        "key": "13761-53806",
                        "label": "46.9 Пчеловодство. Шелководство. Кошениль. Шмели-опылители",
                        "children": []
                    }
                ]
            },
            {
                "key": "601-13444",
                "label": "47 Охотничье хозяйство. Рыбное хозяйство",
                "children": [
                    {
                        "key": "13444-13449",
                        "label": "47.1 Охотничье хозяйство",
                        "children": []
                    },
                    {
                        "key": "13444-13445",
                        "label": "47.2 Рыбное хозяйство",
                        "children": []
                    }
                ]
            },
            {
                "key": "601-4836",
                "label": "48 Ветеринария",
                "children": [
                    {
                        "key": "4836-27167",
                        "label": "48.1 Зоогигиена и ветеринарная санитария",
                        "children": []
                    },
                    {
                        "key": "4836-27170",
                        "label": "48.7 Частная патология и терапия заразных и незаразных болезней животных",
                        "children": []
                    }
                ]
            }
        ]
    },
    {
        "key": "602",
        "label": "Здравоохранение. Медицинские науки",
        "children": [
            {
                "key": "602-618",
                "label": "5г История медицины и здравоохранения",
                "children": []
            },
            {
                "key": "602-1789",
                "label": "51 Социальная гигиена и организация здравоохранения. Гигиена. Эпидемиология",
                "children": [
                    {
                        "key": "1789-24531",
                        "label": "51.1 Социальная гигиена и организация здравоохранения",
                        "children": []
                    },
                    {
                        "key": "1789-25042",
                        "label": "51.2 Гигиена",
                        "children": []
                    },
                    {
                        "key": "1789-25041",
                        "label": "51.9 Эпидемиология",
                        "children": []
                    }
                ]
            },
            {
                "key": "602-5566",
                "label": "52 Общая патология. Медицинская вирусология, микробиология и паразитология. Фармакология, фармация и токсикология",
                "children": [
                    {
                        "key": "5566-26422",
                        "label": "52.5 Общая патология",
                        "children": []
                    },
                    {
                        "key": "5566-26705",
                        "label": "52.6 Медицинская вирусология, микробиология и паразитология",
                        "children": []
                    },
                    {
                        "key": "5566-26706",
                        "label": "52.8 Фармакология. Фармация. Токсикология",
                        "children": []
                    }
                ]
            },
            {
                "key": "602-619",
                "label": "53-57 Клиническая медицина",
                "children": [
                    {
                        "key": "619-6004",
                        "label": "53.4 Общая диагностика",
                        "children": []
                    },
                    {
                        "key": "619-6005",
                        "label": "53.5 Общая терапия",
                        "children": []
                    },
                    {
                        "key": "619-12211",
                        "label": "53.6 Медицинская радиология и рентгенология",
                        "children": []
                    },
                    {
                        "key": "619-5568",
                        "label": "54.1 Внутренние болезни",
                        "children": []
                    },
                    {
                        "key": "619-681",
                        "label": "54.5 Хирургия",
                        "children": []
                    },
                    {
                        "key": "619-6035",
                        "label": "55.1 Инфекционные и паразитарные болезни",
                        "children": []
                    },
                    {
                        "key": "619-45638",
                        "label": "55.4 Фтизиатрия",
                        "children": []
                    },
                    {
                        "key": "619-6038",
                        "label": "55.6 Онкология",
                        "children": []
                    },
                    {
                        "key": "619-8170",
                        "label": "55.8 Венерология. Дерматология",
                        "children": []
                    },
                    {
                        "key": "619-682",
                        "label": "56.1 Невропатология. Нейрохирургия. Психиатрия",
                        "children": []
                    },
                    {
                        "key": "619-6034",
                        "label": "56.6 Стоматология",
                        "children": []
                    },
                    {
                        "key": "619-3809",
                        "label": "56.7 Офтальмология",
                        "children": []
                    },
                    {
                        "key": "619-6037",
                        "label": "56.8 Оториноларингология",
                        "children": []
                    },
                    {
                        "key": "619-8171",
                        "label": "56.9 Урология",
                        "children": []
                    },
                    {
                        "key": "619-7366",
                        "label": "57.0 Медицинская сексология",
                        "children": []
                    },
                    {
                        "key": "619-6039",
                        "label": "57.1 Гинекология",
                        "children": []
                    },
                    {
                        "key": "619-6036",
                        "label": "57.3 Педиатрия",
                        "children": []
                    }
                ]
            },
            {
                "key": "602-620",
                "label": "58 Прикладные отрасли медицины",
                "children": []
            }
        ]
    },
    {
        "key": "603",
        "label": "Общественные и гуманитарные науки",
        "children": [
            {
                "key": "603-621",
                "label": "60 Общественные науки в целом",
                "children": [
                    {
                        "key": "621-5575",
                        "label": "60.0 Социальная философия",
                        "children": []
                    },
                    {
                        "key": "621-642",
                        "label": "60.5 Социология",
                        "children": []
                    },
                    {
                        "key": "621-3947",
                        "label": "60.6 Статистика",
                        "children": []
                    },
                    {
                        "key": "621-1914",
                        "label": "60.7 Демография",
                        "children": []
                    },
                    {
                        "key": "621-643",
                        "label": "60.8 Социальное управление",
                        "children": []
                    },
                    {
                        "key": "621-19272",
                        "label": "60.9 Социальная работа",
                        "children": []
                    }
                ]
            },
            {
                "key": "603-3180",
                "label": "63 История. Исторические науки",
                "children": [
                    {
                        "key": "3180-26169",
                        "label": "63.2 Источниковедение. Вспомогательные (специальные) исторические дисциплины",
                        "children": []
                    },
                    {
                        "key": "3180-24367",
                        "label": "63.3 История",
                        "children": []
                    },
                    {
                        "key": "3180-26170",
                        "label": "63.4 Археология",
                        "children": []
                    },
                    {
                        "key": "3180-26171",
                        "label": "63.5 Этнография",
                        "children": []
                    }
                ]
            },
            {
                "key": "603-622",
                "label": "65 Экономика. Экономические науки",
                "children": [
                    {
                        "key": "622-647",
                        "label": "65.01 Экономическая теория",
                        "children": []
                    },
                    {
                        "key": "622-648",
                        "label": "65.02 История экономической мысли",
                        "children": []
                    },
                    {
                        "key": "622-7292",
                        "label": "65.03 Экономическая история",
                        "children": []
                    },
                    {
                        "key": "622-3716",
                        "label": "65.04 Экономическая география",
                        "children": []
                    },
                    {
                        "key": "622-650",
                        "label": "65.05 Управление экономикой. Экономическая статистика. Учет",
                        "children": [
                            {
                                "key": "650-698",
                                "label": "65.050 Управление экономикой",
                                "children": []
                            },
                            {
                                "key": "650-699",
                                "label": "65.051 Экономическая статистика",
                                "children": []
                            },
                            {
                                "key": "650-701",
                                "label": "65.052 Учет",
                                "children": []
                            },
                            {
                                "key": "650-702",
                                "label": "65.053 Экономический анализ",
                                "children": []
                            }
                        ]
                    },
                    {
                        "key": "622-649",
                        "label": "65.2-4 Специальные и отраслевые экономики",
                        "children": [
                            {
                                "key": "649-683",
                                "label": "65.23 Планирование. Экономическое прогнозирование",
                                "children": []
                            },
                            {
                                "key": "649-684",
                                "label": "65.24 Экономика труда",
                                "children": []
                            },
                            {
                                "key": "649-685",
                                "label": "65.26 Финансы. Денежное обращение. Кредит",
                                "children": []
                            },
                            {
                                "key": "649-686",
                                "label": "65.27 Страхование. Социальное обеспечение",
                                "children": []
                            },
                            {
                                "key": "649-8357",
                                "label": "65.28 Экономика природопользования. Экономика охраны окружающей среды",
                                "children": []
                            },
                            {
                                "key": "649-687",
                                "label": "65.29 Экономика предприятия (фирмы)",
                                "children": []
                            },
                            {
                                "key": "649-688",
                                "label": "65.30 Экономика промышленности",
                                "children": []
                            },
                            {
                                "key": "649-689",
                                "label": "65.31 Экономика строительства",
                                "children": []
                            },
                            {
                                "key": "649-690",
                                "label": "65.32 Экономика сельского хозяйства",
                                "children": []
                            },
                            {
                                "key": "649-5090",
                                "label": "65.37 Экономика транспорта",
                                "children": []
                            },
                            {
                                "key": "649-61461",
                                "label": "65.38 Экономика связи",
                                "children": []
                            },
                            {
                                "key": "649-691",
                                "label": "65.39 Экономика информатики",
                                "children": []
                            },
                            {
                                "key": "649-692",
                                "label": "65.40 Материально-техническое обеспечение",
                                "children": []
                            },
                            {
                                "key": "649-693",
                                "label": "65.42 Экономика торговли",
                                "children": []
                            },
                            {
                                "key": "649-694",
                                "label": "65.43 Экономика общественного питания. Экономика гостиничного хозяйства. Экономика туризма",
                                "children": []
                            },
                            {
                                "key": "649-3573",
                                "label": "65.44 Экономика жилищно-коммунального хозяйства. Экономика бытового обслуживания",
                                "children": []
                            },
                            {
                                "key": "649-30335",
                                "label": "65.45 Экономика мелиоративного хозяйства. Экономика водного хозяйства",
                                "children": []
                            },
                            {
                                "key": "649-695",
                                "label": "65.49 Экономика непроизводственной (социально-культурной) сферы",
                                "children": []
                            }
                        ]
                    },
                    {
                        "key": "622-3538",
                        "label": "65.5 Мировая экономика",
                        "children": []
                    },
                    {
                        "key": "622-24742",
                        "label": "65.6 Экономика развитых стран",
                        "children": []
                    },
                    {
                        "key": "622-5752",
                        "label": "65.7 Экономика развивающихся стран",
                        "children": []
                    },
                    {
                        "key": "622-4333",
                        "label": "65.9 Экономика отдельных стран и регионов. Экономика Мирового Океана",
                        "children": []
                    }
                ]
            },
            {
                "key": "603-623",
                "label": "66 Политика. Политическая наука",
                "children": [
                    {
                        "key": "623-651",
                        "label": "66.0 Теория политики. Политология",
                        "children": []
                    },
                    {
                        "key": "623-652",
                        "label": "66.1 История политической мысли",
                        "children": []
                    },
                    {
                        "key": "623-7139",
                        "label": "66.2 Политика и современное политическое положение в целом",
                        "children": []
                    },
                    {
                        "key": "623-3491",
                        "label": "66.3 Внутренняя политика. Внутреннее положение",
                        "children": []
                    },
                    {
                        "key": "623-5238",
                        "label": "66.4 Внешняя политика. Международные отношения. Дипломатия",
                        "children": []
                    },
                    {
                        "key": "623-7293",
                        "label": "66.5 Национальная политика. Национальные отношения",
                        "children": []
                    },
                    {
                        "key": "623-653",
                        "label": "66.6 Политические партии",
                        "children": []
                    },
                    {
                        "key": "623-16908",
                        "label": "66.7 Общественно-политические организации, движения, союзы",
                        "children": []
                    }
                ]
            },
            {
                "key": "603-624",
                "label": "67 Право. Юридические науки",
                "children": [
                    {
                        "key": "624-654",
                        "label": "67.0 Общая теория права",
                        "children": []
                    },
                    {
                        "key": "624-28703",
                        "label": "67.1 История правовой мысли",
                        "children": []
                    },
                    {
                        "key": "624-655",
                        "label": "67.3 История права",
                        "children": []
                    },
                    {
                        "key": "624-656",
                        "label": "67.4 Отрасли права",
                        "children": [
                            {
                                "key": "656-705",
                                "label": "67.400 Конституционное право",
                                "children": []
                            },
                            {
                                "key": "656-706",
                                "label": "67.401 Административное право",
                                "children": []
                            },
                            {
                                "key": "656-707",
                                "label": "67.402 Финансовое право",
                                "children": []
                            },
                            {
                                "key": "656-708",
                                "label": "67.404 Гражданское право и торговое право. Семейное право",
                                "children": []
                            },
                            {
                                "key": "656-709",
                                "label": "67.405 Трудовое право и право социального обеспечения",
                                "children": []
                            },
                            {
                                "key": "656-710",
                                "label": "67.406 Кооперативное право",
                                "children": []
                            },
                            {
                                "key": "656-711",
                                "label": "67.407 Земельное право. Горное право. Водное право. Лесное право",
                                "children": []
                            },
                            {
                                "key": "656-712",
                                "label": "67.408 Уголовное право",
                                "children": []
                            },
                            {
                                "key": "656-713",
                                "label": "67.409 Исполнительно-трудовое право",
                                "children": []
                            },
                            {
                                "key": "656-714",
                                "label": "67.410 Гражданско-процессуальное право",
                                "children": []
                            },
                            {
                                "key": "656-715",
                                "label": "67.411 Уголовно-процессуальное право",
                                "children": []
                            },
                            {
                                "key": "656-716",
                                "label": "67.412 Международное право",
                                "children": []
                            }
                        ]
                    },
                    {
                        "key": "624-657",
                        "label": "67.5 Отрасли знаний, примыкающие к юриспруденции",
                        "children": []
                    },
                    {
                        "key": "624-658",
                        "label": "67.6 ГМУ",
                        "children": []
                    },
                    {
                        "key": "624-659",
                        "label": "67.7 Органы юстиции",
                        "children": []
                    },
                    {
                        "key": "624-660",
                        "label": "67.9 Международное право. Право отдельных стран",
                        "children": []
                    },
                    {
                        "key": "624-661",
                        "label": "Основные нормативные источники",
                        "children": []
                    }
                ]
            },
            {
                "key": "603-625",
                "label": "68 Военное дело. Военная наука",
                "children": [
                    {
                        "key": "625-26731",
                        "label": "68.0 Военная наука в целом",
                        "children": []
                    },
                    {
                        "key": "625-55343",
                        "label": "68.1 Военная политика, военные доктрины",
                        "children": []
                    },
                    {
                        "key": "625-36843",
                        "label": "68.2 Теория военного искусства",
                        "children": []
                    },
                    {
                        "key": "625-26414",
                        "label": "68.3 Военно-историческая наука",
                        "children": []
                    },
                    {
                        "key": "625-26164",
                        "label": "68.4 Вооруженные силы в целом",
                        "children": []
                    },
                    {
                        "key": "625-24359",
                        "label": "68.5-7 Отдельные виды вооруженных сил, рода войск",
                        "children": []
                    },
                    {
                        "key": "625-26165",
                        "label": "68.8 Военная техника",
                        "children": []
                    },
                    {
                        "key": "625-24772",
                        "label": "68.9 Служба по чрезвычайным ситуациям",
                        "children": []
                    }
                ]
            },
            {
                "key": "603-626",
                "label": "70-79 Культура. Наука. Просвещение",
                "children": [
                    {
                        "key": "626-23966",
                        "label": "70 Культура. Наука. Просвещение",
                        "children": []
                    },
                    {
                        "key": "626-3972",
                        "label": "71 Культура. Культурология",
                        "children": [
                            {
                                "key": "3972-24792",
                                "label": "71.0 Теоретическая культурология",
                                "children": []
                            },
                            {
                                "key": "3972-25449",
                                "label": "71.1 Историческая культурология. История культурологических учений",
                                "children": []
                            },
                            {
                                "key": "3972-26192",
                                "label": "71.4 Прикладная (практическая) культурология",
                                "children": []
                            }
                        ]
                    },
                    {
                        "key": "626-662",
                        "label": "72 Наука. Науковедение",
                        "children": [
                            {
                                "key": "662-24370",
                                "label": "72.3 История науки",
                                "children": []
                            },
                            {
                                "key": "662-24801",
                                "label": "72.4 Организация науки",
                                "children": []
                            },
                            {
                                "key": "662-26193",
                                "label": "72.6 Ученые. Научные работники",
                                "children": []
                            }
                        ]
                    },
                    {
                        "key": "626-5243",
                        "label": "73 Научно-информационная деятельность",
                        "children": [
                            {
                                "key": "5243-26848",
                                "label": "73.0 Теория научно-информационной деятельности",
                                "children": []
                            },
                            {
                                "key": "5243-47414",
                                "label": "73.4 Организация научно-информационной деятельности. Управление. Экономика. Статистика",
                                "children": []
                            },
                            {
                                "key": "5243-54608",
                                "label": "73.7 Хранение и поиск информации",
                                "children": []
                            },
                            {
                                "key": "5243-29645",
                                "label": "73.6 Сбор, обработка и ввод информации",
                                "children": []
                            },
                            {
                                "key": "5243-29642",
                                "label": "73.8 Информационное обслуживание. Использование информации",
                                "children": []
                            },
                            {
                                "key": "5243-30857",
                                "label": "73.9 Научно-информационная деятельность в области отдельных видов документов",
                                "children": []
                            }
                        ]
                    },
                    {
                        "key": "626-663",
                        "label": "74 Образование. Педагогическая наука",
                        "children": [
                            {
                                "key": "663-24854",
                                "label": "74.00 Общая педагогика",
                                "children": []
                            },
                            {
                                "key": "663-24855",
                                "label": "74.03 История образования и педагогической мысли",
                                "children": []
                            },
                            {
                                "key": "663-24856",
                                "label": "74.04 Организация образования",
                                "children": []
                            },
                            {
                                "key": "663-30541",
                                "label": "74.05 Непрерывное образование",
                                "children": []
                            },
                            {
                                "key": "663-24349",
                                "label": "74.1 Дошкольное воспитание. Дошкольная педагогика",
                                "children": []
                            },
                            {
                                "key": "663-24350",
                                "label": "74.2 Общеобразовательная школа. Педагогика школы",
                                "children": []
                            },
                            {
                                "key": "663-24351",
                                "label": "74.3 Специальные школы. Дефектология (коррекционная педагогика)",
                                "children": []
                            },
                            {
                                "key": "663-24857",
                                "label": "74.4 Образование взрослых. Педагогика взрослых",
                                "children": []
                            },
                            {
                                "key": "663-24858",
                                "label": "74.5 Профессиональное и специальное образование",
                                "children": []
                            },
                            {
                                "key": "663-24859",
                                "label": "74.6 Специализированные отрасли педагогики",
                                "children": []
                            },
                            {
                                "key": "663-24860",
                                "label": "74.9 Семейное воспитание и образование",
                                "children": []
                            }
                        ]
                    },
                    {
                        "key": "626-664",
                        "label": "75 Физическая культура и спорт",
                        "children": [
                            {
                                "key": "664-25273",
                                "label": "75.0 Медико-биологические основы физического воспитания",
                                "children": []
                            },
                            {
                                "key": "664-26206",
                                "label": "75.1 Теория и методика физического воспитания и физической тренировки",
                                "children": []
                            },
                            {
                                "key": "664-26207",
                                "label": "75.3 История физической культуры",
                                "children": []
                            },
                            {
                                "key": "664-26208",
                                "label": "75.4 Организация физической культуры и спорта",
                                "children": []
                            },
                            {
                                "key": "664-24862",
                                "label": "75.5 Игры. Спортивные игры",
                                "children": []
                            },
                            {
                                "key": "664-25094",
                                "label": "75.6 Гимнастика",
                                "children": []
                            },
                            {
                                "key": "664-24866",
                                "label": "75.7 Спорт",
                                "children": []
                            },
                            {
                                "key": "664-24865",
                                "label": "75.8 Туризм. Альпинизм",
                                "children": []
                            }
                        ]
                    },
                    {
                        "key": "626-665",
                        "label": "76 Средства массовой информации. Книжное дело",
                        "children": [
                            {
                                "key": "665-7294",
                                "label": "76.0 Средства массовой информации (СМИ)",
                                "children": [
                                    {
                                        "key": "7294-3744",
                                        "label": "76.01 Журналистика",
                                        "children": []
                                    },
                                    {
                                        "key": "7294-43615",
                                        "label": "76.02 Периодическая печать",
                                        "children": []
                                    },
                                    {
                                        "key": "7294-7061",
                                        "label": "76.03 Радиовещание. Телевидение",
                                        "children": []
                                    },
                                    {
                                        "key": "7294-726",
                                        "label": "76.006.5 Реклама в СМИ",
                                        "children": []
                                    }
                                ]
                            },
                            {
                                "key": "665-9052",
                                "label": "76.1 Книжное дело. Книговедение",
                                "children": []
                            }
                        ]
                    },
                    {
                        "key": "626-14275",
                        "label": "77 Социокультурная деятельность в сфере досуга",
                        "children": [
                            {
                                "key": "14275-33421",
                                "label": "77.056 Организация отдыха и развлечения",
                                "children": []
                            },
                            {
                                "key": "14275-29644",
                                "label": "77.02 Методика социокультурной деятельности в сфере досуга",
                                "children": []
                            },
                            {
                                "key": "14275-26210",
                                "label": "77.04 Организация социокультурной деятельности в сфере досуга",
                                "children": []
                            },
                            {
                                "key": "14275-26212",
                                "label": "77.2 Клубная работа",
                                "children": []
                            }
                        ]
                    },
                    {
                        "key": "626-666",
                        "label": "78 Библиотечное дело. Библиотековедение. Библиография. Библиографоведение",
                        "children": [
                            {
                                "key": "666-24530",
                                "label": "78.3 Библиотечное дело. Библиотековедение",
                                "children": []
                            },
                            {
                                "key": "666-25954",
                                "label": "78.5 Библиография. Библиографоведение",
                                "children": []
                            }
                        ]
                    },
                    {
                        "key": "626-4221",
                        "label": "79 Охрана памятников природы, истории и культуры. Музейное дело. Архивное дело",
                        "children": [
                            {
                                "key": "4221-32024",
                                "label": "79.0 Охрана памятников природы, истории и культуры",
                                "children": []
                            },
                            {
                                "key": "4221-27809",
                                "label": "79.1 Музейное дело. Музееведение",
                                "children": []
                            },
                            {
                                "key": "4221-35615",
                                "label": "79.3 Архивное дело. Архивоведение",
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "key": "603-627",
                "label": "80-84 Филологические науки. Художественная литература",
                "children": [
                    {
                        "key": "627-3968",
                        "label": "80 Филологические науки в целом",
                        "children": [
                            {
                                "key": "3968-29861",
                                "label": "80.9 Текстология",
                                "children": []
                            },
                            {
                                "key": "3968-26423",
                                "label": "80.4 Частные филологии",
                                "children": []
                            }
                        ]
                    },
                    {
                        "key": "627-667",
                        "label": "81 Языкознание",
                        "children": [
                            {
                                "key": "667-26420",
                                "label": "81.1 Прикладное языкознание",
                                "children": []
                            },
                            {
                                "key": "667-24331",
                                "label": "81.2 Частное языкознание. Языки мира",
                                "children": []
                            },
                            {
                                "key": "667-28588",
                                "label": "81.8 Искусственные (международные, вспомогательные) языки",
                                "children": []
                            }
                        ]
                    },
                    {
                        "key": "627-4482",
                        "label": "82 Фольклор. Фольклористика",
                        "children": [
                            {
                                "key": "4482-52310",
                                "label": "82.0 Теория фольклора",
                                "children": []
                            },
                            {
                                "key": "4482-28587",
                                "label": "82.3 Мировой фольклор. Фольклор отдельных континентов, стран и народов",
                                "children": []
                            }
                        ]
                    },
                    {
                        "key": "627-2875",
                        "label": "83 Литературоведение",
                        "children": [
                            {
                                "key": "2875-26419",
                                "label": "83.0 Теория литературы",
                                "children": []
                            },
                            {
                                "key": "2875-27812",
                                "label": "83.2 Литературная критика",
                                "children": []
                            },
                            {
                                "key": "2875-26196",
                                "label": "83.3 История и критика мировой литературы и литературы отдельных стран",
                                "children": []
                            },
                            {
                                "key": "2875-24810",
                                "label": "83.7 Ораторское искусство",
                                "children": []
                            },
                            {
                                "key": "2875-39862",
                                "label": "83.8 Детская литература",
                                "children": []
                            }
                        ]
                    },
                    {
                        "key": "627-3795",
                        "label": "84 Художественная литература (произведения)",
                        "children": []
                    }
                ]
            },
            {
                "key": "603-4256",
                "label": "85 Искусство. Искусствознание",
                "children": [
                    {
                        "key": "4256-26712",
                        "label": "85.0 Теория искусства",
                        "children": []
                    },
                    {
                        "key": "4256-4259",
                        "label": "85.1 Изобразительное искусство и архитектура",
                        "children": []
                    },
                    {
                        "key": "4256-27541",
                        "label": "85.30 Музыка и зрелищные искусства в целом",
                        "children": []
                    },
                    {
                        "key": "4256-24861",
                        "label": "85.31 Музыка",
                        "children": []
                    },
                    {
                        "key": "4256-26713",
                        "label": "85.32 Танец (хореография)",
                        "children": []
                    },
                    {
                        "key": "4256-24863",
                        "label": "85.33 Театр",
                        "children": []
                    },
                    {
                        "key": "4256-26714",
                        "label": "85.34 Массовые представления и театрализованные праздники",
                        "children": []
                    },
                    {
                        "key": "4256-29643",
                        "label": "85.35 Цирк",
                        "children": []
                    },
                    {
                        "key": "4256-55752",
                        "label": "85.36 Эстрада",
                        "children": []
                    },
                    {
                        "key": "4256-24864",
                        "label": "85.37 Киноискусство",
                        "children": []
                    },
                    {
                        "key": "4256-26204",
                        "label": "85.38 Художественное радиовещание и художественное телевидение",
                        "children": []
                    },
                    {
                        "key": "4256-26205",
                        "label": "85.7 Художественная самодеятельность",
                        "children": []
                    }
                ]
            },
            {
                "key": "603-3801",
                "label": "86 Религия. Мистика. Свободомыслие",
                "children": [
                    {
                        "key": "3801-6609",
                        "label": "86.2 Религиоведение",
                        "children": []
                    },
                    {
                        "key": "3801-6610",
                        "label": "86.3 Отдельные религии",
                        "children": []
                    },
                    {
                        "key": "3801-18065",
                        "label": "86.4 Мистика",
                        "children": []
                    }
                ]
            },
            {
                "key": "603-628",
                "label": "87 Философия",
                "children": [
                    {
                        "key": "628-5571",
                        "label": "87.2 Метафизика. Гносеология",
                        "children": []
                    },
                    {
                        "key": "628-668",
                        "label": "87.3 История философии",
                        "children": []
                    },
                    {
                        "key": "628-4186",
                        "label": "87.4 Логика",
                        "children": []
                    },
                    {
                        "key": "628-3737",
                        "label": "87.6 Социальная философия",
                        "children": []
                    },
                    {
                        "key": "628-669",
                        "label": "87.7 Этика",
                        "children": []
                    },
                    {
                        "key": "628-7140",
                        "label": "87.8 Эстетика",
                        "children": []
                    }
                ]
            },
            {
                "key": "603-629",
                "label": "88 Психология",
                "children": [
                    {
                        "key": "629-3952",
                        "label": "88.1 История психологии",
                        "children": []
                    },
                    {
                        "key": "629-26421",
                        "label": "88.2 Развитие психики",
                        "children": []
                    },
                    {
                        "key": "629-670",
                        "label": "88.3 Общая психология",
                        "children": []
                    },
                    {
                        "key": "629-671",
                        "label": "88.4 Отраслевая психология",
                        "children": []
                    },
                    {
                        "key": "629-672",
                        "label": "88.5 Социальная психология",
                        "children": []
                    },
                    {
                        "key": "629-18322",
                        "label": "88.6 Особые состояния и явления психики",
                        "children": []
                    },
                    {
                        "key": "629-673",
                        "label": "88.8 Детская психология",
                        "children": []
                    }
                ]
            }
        ]
    },
    {
        "key": "604",
        "label": "Литература универсального содержания",
        "children": [
            {
                "key": "604-6033",
                "label": "91 Библиографические пособия",
                "children": []
            },
            {
                "key": "604-630",
                "label": "92 Справочные издания",
                "children": []
            },
            {
                "key": "604-3950",
                "label": "94 Серии. Сборники",
                "children": []
            }
        ]
    }
] as TreeNode[];

